
########################### Define Top Module ############################
                                                   
set top_module SYS_TOP

######################### Formality Setup File ###########################

set synopsys_auto_setup true

set_svf "../../DFT/$top_module.svf"


set SSLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ss_1p08v_125c.db"
set TTLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"
set FFLIB "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_ff_1p32v_m40c.db"

######################### Reference Container ############################

## Read Reference technology libraries

read_db -container r "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db"

## Read Reference Design Files

read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/SYS_TOP.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/ALU_16B.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/Async_fifo.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/CLK_DIV.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/CLK_GATE.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/controller.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/DATA_SAMPLING_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/DATA_SYNC.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/DESERIALIZER_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/DF_Sync.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/EDGE_BIT_COUNTER_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/fifo_mem.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/fifo_rd.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/fifo_wr.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/FSM_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/FSM_rx_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/MUX_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/PARITY_CALC_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/PARITY_CHECK_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/PULSE_GEN.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/REGISTER_FILE.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/RST_SYNC.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/SERIALIZER_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/START_CHECK_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/STOP_CHECK_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/UART_RX_TOP.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/UART_TOP.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/UART_TX_1.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/SYS_TOP.v"
read_verilog -container r "/home/IC/assignments/formal_sys_dft/rtl/mux2X1.v"

## set the top Reference Design 

set_top SYS_TOP

######################## Implementation Container #########################

## Read Implementation technology libraries

read_db -container i "/home/IC/tsmc_fb_cl013g_sc/aci/sc-m/synopsys/scmetro_tsmc_cl013g_rvt_tt_1p2v_25c.db" 

## Read Implementation Design Files

read_verilog -container i "/home/IC/assignments/formal_sys_dft/DFT/SYS_TOP.v" 

## set the top Implementation Design

set_top SYS_TOP

############################### Don't verify #################################

# do not verify scan in & scan out ports as a compare point as it is existed only after synthesis and not existed in the RTL

#scan in

set_dont_verify_points -type port r:/WORK/*/SI 
set_dont_verify_points -type port i:/WORK/*/SI



#scan_out

set_dont_verify_points -type port r:/WORK/*/SO
set_dont_verify_points -type port i:/WORK/*/SO

############################### constants #####################################

# all atpg enable(test_mode, scan_enable) are zero during formal compare

#test_mode

set_constant r:/WORK/*/test_mode 0
set_constant i:/WORK/*/test_mode 0

#scan_enable

set_constant r:/WORK/*/SE 0
set_constant i:/WORK/*/SE 0

########################### matching Compare points ##########################

match

################################# verify #####################################

set successful [verify]
if {!$successful} {
diagnose
analyze_points -failing
}

report_passing_points > "reports/passing_points.rpt"
report_failing_points > "reports/failing_points.rpt"
report_aborted_points > "reports/aborted_points.rpt"
report_unverified_points > "reports/unverified_points.rpt"


start_gui
